Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/SSI-SE955-Omegat-level2.tmx
Source language: en_us
Languages: it_it

source: Some of the registers bundling a number of single bits are detailed in extra tables.
it_it: Alcuni dei registri che raggruppano più bit singoli sono descritti in dettaglio in tabelle aggiuntive.

source: Some registers represent unsigned (positive) values, some represent integer values (signed) as two’s complement numbers, single bits or groups of bits are represented as single bits respectively as integer groups.
it_it: Alcuni registri rappresentano valori senza segno (positivi), alcuni rappresentano valori interi (con segno) come numeri in complemento a due, singoli bit o gruppi di bit sono rappresentati rispettivamente come singoli bit come gruppi di interi.

source: Sounds the beeper.
it_it: Suona il segnale acustico.

source: Specifies lower CoolStep velocity by comparing the threshold value to
it_it: Specifica la velocità CoolStep inferiore confrontando il valore di soglia con

source: SpreadCycle automatically integrates a fast decay cycle and guarantees smooth zero crossing performance.
it_it: SpreadCycle integra automaticamente un ciclo di decadimento rapido e garantisce prestazioni di zero crossing fluide.

source: StallGuard is a sensorless load measurement for stepper motors.
it_it: StallGuard è un sistema di misurazione del carico senza sensori per motori passo-passo.

source: StallGuard2 Values SG
it_it: Valori di StallGuard2 SG

source: StallGuard2 does not operate reliably at extreme motor velocities: Very low motor velocities (for many motors, less than one revolution per second) generate a low back EMF and make the measurement unstable and dependent on environment conditions (temperature, etc.).
it_it: StallGuard2 non funziona in modo affidabile a velocità estreme del motore: velocità del motore molto basse (per molti motori, inferiori a un giro al secondo) generano una bassa forza controelettromotrice (FEM) e rendono la misurazione instabile e dipendente dalle condizioni ambientali (temperatura, ecc.).

source: StallGuard2 measures which part of the energy fed to the motor goes back to the power supply.
it_it: StallGuard2 misura quale parte dell'energia immessa nel motore viene restituita all'alimentatore.

source: StallGuard2 provides an accurate measurement of the load on the motor.
it_it: StallGuard2 fornisce una misurazione accurata del carico sul motore.

source: StallGuard2 value below the lower threshold.
it_it: Valore StallGuard2 inferiore alla soglia inferiore.

source: StallGuard4 differs from StallGuard2 in multiple aspects.
it_it: StallGuard4 differisce da StallGuard2 per diversi aspetti.

source: StallGuard4 operates off a different MOSFET chopping scheme than StallGuard2 does.
it_it: StallGuard4 funziona con uno schema di chopping dei MOSFET diverso da quello di StallGuard2.

source: Status
it_it: Stato

source: Status word
it_it: Word di stato

source: StealthChop adapts the PWM_SCALE values to ensure the motor is reaching the target current.
it_it: StealthChop adatta i valori PWM_SCALE per garantire che il motore raggiunga la corrente target.

source: StealthChop can be combined with classic cycle-by-cycle chopper modes for best performance in all velocity ranges.
it_it: StealthChop può essere combinato con le classiche modalità chopper ciclo per ciclo per prestazioni ottimali in tutti gli intervalli di velocità.

source: StealthChop is a voltage chopper-based principle.
it_it: StealthChop è un principio basato sul chopper di tensione.

source: StealthChop is a voltage control scheme for the MOSFETs and is used with StallGuard4.
it_it: StealthChop è uno schema di controllo della tensione per i MOSFET e viene utilizzato con StallGuard4.

source: StealthChop is an extremely quiet mode of operation for stepper motors.
it_it: StealthChop è una modalità di funzionamento estremamente silenziosa per motori passo-passo.

source: Stepper motor#2 operates as brake for motor #1.
it_it: Il motore passo-passo n. 2 funge da freno per il motore n. 1.

source: Stepper motors are driven in steps in open loop configuration by sending electrical current through the motor coils.
it_it: I motori passo-passo vengono azionati a passi in configurazione ad anello aperto inviando corrente elettrica attraverso le bobine del motore.

source: Sub-Field
it_it: Sottocampo

source: Summary
it_it: Sommario

source: Switch on sfilt.
it_it: Attivare sfilt.

source: TCOOLTHRS is compared to TSTEP, which is the measured time between two 1/256 microsteps derived from the step frequency.
it_it: TCOOLTHRS viene confrontato con TSTEP, che è il tempo misurato tra due micropassi da 1/256 derivato dalla frequenza del passo.

source: TXD: Serial data transmit output.
it_it: TXD: Output di trasmissione dati seriali.

source: Table 2-2 lists the SSI commands by Opcode.
it_it: La Tabella 2-2 elenca i comandi SSI per codice Operativo.

source: Table 7.1 Choice of PWM frequency – green: recommended
it_it: Tabella 7.1 Scelta della frequenza PWM – verde: consigliata

source: Table of Contents
it_it: Sommario

source: Take this SG_RESULT value, divide it by 2, and put it into SGTHRS.
it_it: Prendere questo valore di SG_RESULT, dividerlo per 2 e inserirlo in SGTHRS.

source: Tells decoder to abort a decode attempt.
it_it: Indica al decoder di interrompere un tentativo di decodifica.

source: Tells decoder to attempt to decode a bar code.
it_it: Indica al decoder di tentare di decodificare un codice a barre.

source: Tells the decoder to eliminate all packets in its transmission queue.
it_it: Indica al decoder di eliminare tutti i pacchetti nella coda di trasmissione.

source: Terminates MacroPDF sequence and discards all captured segments.
it_it: Termina la sequenza MacroPDF e scarta tutti i segmenti catturati.

source: Terminates MacroPDF sequence and discards segments.
it_it: Termina la sequenza MacroPDF e scarta i segmenti.

source: Terminates MacroPDF sequence and transmits captured segments.
it_it: Termina la sequenza MacroPDF e trasmette i segmenti catturati.

source: The 4-bit SEMIN value is scaled by 32 to cover the lower half of the range of the 10-bit SG_RESULT value.
it_it: Il valore SEMIN a 4 bit viene scalato di 32 per coprire la metà inferiore dell'intervallo del valore SG_RESULT a 10 bit.

source: The SGT setting chosen as a result of the previously described SGT tuning can be used for a certain velocity range.
it_it: L'impostazione SGT scelta in seguito alla messa a punto SGT descritta in precedenza può essere utilizzata per un determinato intervallo di velocità.

source: The Table of contents StallGuard of the TMC246 and TMC249 differs from both StallGuard2 and StallGuard4.
it_it: L' Indice StallGuard del TMC246 e del TMC249 differisce sia da StallGuard2 che da StallGuard4.

source: The CoolStep feature must be switched off (by setting parameter SGMIN=0) while doing the parameterization of StallGuard2.
it_it: La funzionalità CoolStep deve essere disattivata (impostando il parametro SGMIN=0) durante la parametrizzazione di StallGuard2.

source: The CoolStep function is based on the sensorless stall detection.
it_it: La funzione CoolStep si basa sul rilevamento dello stallo senza sensori.

source: The CoolStep parameter register (SMARTEN or COOLCONF) is described within the specific IC datasheet.
it_it: Il registro dei parametri CoolStep (SMARTEN o COOLCONF) è descritto nella scheda tecnica specifica del circuito integrato.

source: The DcStep skipped information is an alternative way to find out when DcStep runs with a velocity below the step velocity.
it_it: Le informazioni DcStep saltate rappresentano un modo alternativo per scoprire quando DcStep funziona con una velocità inferiore alla velocità del passo.

source: The Decode Data Packet Format parameter controls how decode data is sent to the host.
it_it: Il parametro "Decode Data Packet Format" controlla il modo in cui i dati di decodifica vengono inviati all'host.

source: The MicroPlyer STEP pulse interpolator brings the smooth motor operation of highresolution microstepping to applications originally designed for coarser stepping.
it_it: L'interpolatore di impulsi MicroPlyer STEP porta il funzionamento regolare del motore del microstepping ad alta risoluzione ad applicazioni originariamente progettate per stepping più grossolani.

source: The NCS line of the device must be handled in a way, that it stays active (low) for the complete duration of the datagram transmission.
it_it: La linea NCS del dispositivo deve essere gestita in modo che rimanga attiva (bassa) per l'intera durata della trasmissione del datagramma.

source: The PWM frequency can be chosen in a range in four steps to adapt the frequency divider to the frequency of the clock source.
it_it: La frequenza PWM può essere scelta in un intervallo di quattro livelli per adattare il divisore di frequenza alla frequenza della sorgente di clock.

source: The PWM registers for the SpreadCycle chopper current regulation need to be parameterized first as a base for StallGuard2 and CoolStep.
it_it: I registri PWM per la regolazione della corrente del chopper SpreadCycle devono essere parametrizzati prima come base per StallGuard2 e CoolStep.

source: The Parameter Scanning option is required for each product using SSI.
it_it: L'opzione"Parameter Scanning" è obbligatoria per ogni prodotto che utilizza SSI.

source: The SEMIN parameter defines the minimum value of the StallGuard2 signal SG that triggers the increasing of the current if load is detected.
it_it: Il parametro SEMIN definisce il valore minimo del segnale SG di StallGuard2 che attiva l'aumento di corrente in caso di rilevamento di carico.

source: The SEMIN parameter is internally multiplied by 32.
it_it: Il parametro SEMIN viene moltiplicato internamente per 32.

source: The SG value depends on a set of base parameters: motor parameters (EMF constant, inductance, and resistance), supply voltage, speed, current, and last but not least the amount of mechanical load, and the StallGuard2 threshold SGT parameter.
it_it: Il valore di SG dipende da un insieme di parametri di base: parametri del motore (costante EMF, induttanza e resistenza), tensione di alimentazione, velocità, corrente e, ultimo ma non meno importante, l'entità del carico meccanico e il parametro di soglia SGT di StallGuard2.

source: The SGT parameter needs to be adjusted in a way that SG = 0 when the motor comes close to stall.
it_it: Il parametro SGT deve essere regolato in modo che SG = 0 quando il motore si avvicina allo stallo.

source: The SGT value needs to be adjusted in a way that SG = 0 is at maximum load.
it_it: Il valore di SGT deve essere regolato in modo che SG = 0 sia al carico massimo.

source: The SGTHRS parameter operates much differently than the SGT parameter.
it_it: Il parametro SGTHRS funziona in modo molto diverso dal parametro SGT.

source: The SGTHRS value ranges from 0...255.
it_it: Il valore SGTHRS varia da 0 a 255.

source: The SPI bus on the TMC5130A has four signals:
it_it: Il bus SPI sul TMC5130A ha quattro segnali:

source: The SPI command rate typically is a few commands per complete motor motion.
it_it: La frequenza di comando SPI è in genere di pochi comandi per movimento completo del motore.

source: The SPI interface always delivers data back to the master, independent of the W bit.
it_it: L'interfaccia SPI restituisce sempre i dati al master, indipendentemente dal bit W.

source: The SPI interface is a bit-serial interface synchronous to a bus clock.
it_it: L'interfaccia SPI è un'interfaccia seriale a bit sincrona al clock del bus.

source: The SPI interface is synchronized to the internal system clock, which limits the SPI bus clock SCK to half of the system clock frequency.
it_it: L'interfaccia SPI è sincronizzata con il clock di sistema interno, il che limita il clock del bus SPI SCK a metà della frequenza del clock di sistema.

source: The STEP and DIR inputs provide a simple, standard interface compatible with many existing motion controllers.
it_it: Gli ingressi STEP e DIR forniscono un'interfaccia semplice e standard compatibile con molti controller di movimento esistenti.

source: The Simple Serial Interface (SSI) Programmer’s Guide provides system requirements and programming information about Zebra’s Simple Serial Interface, which enables decoders (e.g., SE955 scan engine, hand-held scanners, 2D scanners, etc.) to communicate with a serial host.
it_it: La "Simple Serial Interface (SSI) - Guida alla Programmazione" fornisce i requisiti di sistema e le informazioni di programmazione per la "Simple Serial Interface di Zebra", che consente ai decoder (ad esempio, il motore di scansione SE955, gli scanner portatili, gli scanner 2D, ecc.) di comunicare con un host seriale.

source: The StallGuard value does become more consistent as the current increases, but it does not jump up or down by noticeable margins like it did with StallGuard2.
it_it: Il valore di StallGuard diventa più costante all'aumentare della corrente, ma non aumenta o diminuisce in modo significativo come accadeva con StallGuard2.

source: The StallGuard value is varying but is not impacted by the change in voltage.
it_it: Il valore di StallGuard varia, ma non è influenzato dalla variazione di tensione.

source: The StallGuard2 measurement value SG_RESULT is updated with each full step of the motor.
it_it: Il valore di misurazione di StallGuard2 SG_RESULT viene aggiornato a ogni passo completo del motore.

source: The StallGuard2 measurement value changes linearly over a wide range of load, velocity, and current settings, as shown in Figure 15.1.
it_it: Il valore di misurazione di StallGuard2 varia linearmente in un'ampia gamma di impostazioni di carico, velocità e corrente, come mostrato nella Figura 15.1.

source: The StallGuard2 value SG_RESULT is affected by motor-specific characteristics and application-specific demands on load and velocity.
it_it: Il valore di StallGuard2 SG_RESULT è influenzato dalle caratteristiche specifiche del motore e dalle richieste specifiche dell'applicazione in termini di carico e velocità.

source: The StallGuard2 value SG represents the load angle and the torque.
it_it: Il valore di StallGuard2 SG rappresenta l'angolo di carico e la coppia.

source: The StallGuard2 value SG depends on the amplitude of the motor current linked to the supply voltage.
it_it: Il valore SG di StallGuard2 dipende dall'ampiezza della corrente del motore collegata alla tensione di alimentazione.

source: The StallGuard2 value SG varies with the supply voltage (Figure 2.12).
it_it: Il valore SG di StallGuard2 varia con la tensione di alimentazione (Figura 2.12).

source: The StallGuard2 value SG varies with the velocity because it bases on the Back-EMF of the stepper motor.
it_it: Il valore di StallGuard2 SG varia con la velocità perché si basa sulla forza controelettromotrice del motore passo-passo.

source: The StealthChop tuning must be done before parameterizing StallGuard4.
it_it: La messa a punto di StealthChop deve essere eseguita prima di parametrizzare StallGuard4.

source: The TMC5130 is an integrated motor driver and motion controller solution.
it_it: Il TMC5130 è una soluzione integrata di driver motore e motion controller.

source: The TMC5130A implements advanced features which are exclusive to TRINAMIC products.
it_it: Il TMC5130A implementa funzionalità avanzate esclusive dei prodotti TRINAMIC.

source: The TMC5130A provides an encoder interface for external incremental encoders.
it_it: Il TMC5130A fornisce un'interfaccia encoder per encoder incrementali esterni.

source: The TMC5130A supports both, an SPI interface and a UART based single wire interface with CRC checking.
it_it: Il TMC5130A supporta sia un'interfaccia SPI che un'interfaccia a filo singolo basata su UART con controllo CRC.

source: The TMC5130A uses 40-bit SPI™ (Serial Peripheral Interface, SPI is Trademark of Motorola) datagrams for communication with a microcontroller.
it_it: Il TMC5130A utilizza datagrammi SPI™ (Serial Peripheral Interface, SPI è un marchio registrato di Motorola) a 40 bit per la comunicazione con un microcontrollore.

source: The active high write bit is the MSB of the address byte.
it_it: Il bit di scrittura attivo alto è il bit MSB del byte di indirizzo.

source: The adjustment of the StallGuard2 threshold SGT parameter – that needs to be set in a way that SG=0 at maximum mechanical load – should be done at maximum supply voltage.
it_it: La regolazione del parametro SGT di soglia di StallGuard2, che deve essere impostato in modo che SG = 0 al massimo carico meccanico, deve essere effettuata alla massima tensione di alimentazione.

source: The automatic tuning procedure described above will compensate for this.
it_it: La procedura di ottimizzazione automatica descritta sopra compenserà questo problema.

source: The basic idea behind the SGT setting is a factor, which compensates the StallGuard measurement for resistive losses inside the motor.
it_it: L'idea di base alla base dell'impostazione SGT è un fattore che compensa la misurazione StallGuard per le perdite resistive all'interno del motore.

source: The best way applying mechanical load to a stepper motor is using two identical stepper motors coupled mechanically axis to axis.
it_it: Il modo migliore per applicare un carico meccanico a un motore passo-passo è utilizzare due motori passo-passo identici accoppiati meccanicamente asse-asse.

source: The black line represents the SG_RESULT measurement value.
it_it: La linea nera rappresenta il valore di misurazione SG_RESULT.

source: The blue bar is the hysteresis created from the SEMAX and SEMIN parameters.
it_it: La barra blu rappresenta l'isteresi creata dai parametri SEMAX e SEMIN.

source: The blue line represents the mechanical load applied to the motor.
it_it: La linea blu rappresenta il carico meccanico applicato al motore.

source: The challenge is to choose a range of speed for operation, to benchmark a chosen setting, and to choose the SGT value which fits best.
it_it: La sfida è scegliere un intervallo di velocità per il funzionamento, confrontare un'impostazione scelta e scegliere il valore di SGT più adatto.

source: The chip is loaded with default values during power-up via its internal power-on reset.
it_it: Il chip viene caricato con i valori di default durante l'accensione tramite il suo reset interno.

source: The constant off-time mode provides high torque at highest velocity, while SpreadCycle offers smooth operation and good power efficiency over a wide range of speed and load.
it_it: La modalità a tempo di fermo costante fornisce una coppia elevata alla massima velocità, mentre SpreadCycle offre un funzionamento fluido e una buona efficienza energetica in un'ampia gamma di velocità e carico.

source: The current becomes incremented for each measured
it_it: La corrente viene incrementata per ogni misura

source: The current increment speed is specified in SEUP, and the current decrement speed is specified in SEDN.
it_it: La velocità di incremento corrente è specificata in SEUP e la velocità di decremento corrente è specificata in SEDN.

source: The data transferred back is the data read from the address, which was transmitted with the previous datagram, if the previous access was a read access.
it_it: I dati ritrasmessi sono i dati letti dall'indirizzo, trasmessi con il datagramma precedente, se l'accesso precedente era in lettura.

source: The decoder again checks the state of the CTS line, so the host may interrupt on a character-by-character basis.
it_it: Il decoder controlla nuovamente lo stato della linea CTS, in modo che l'host possa interrompere carattere per carattere.

source: The decoder constantly monitors the CTS line for activity:
it_it: Il decoder monitora costantemente la linea CTS per rilevare eventuali attività:

source: The decoder first ensures that the host is not attempting to send by examining the state of CTS.
it_it: Il decoder verifica innanzitutto che l'host non stia tentando di inviare dati esaminando lo stato del CTS.

source: The decoder is sometimes required to send data to the host.
it_it: Talvolta, il decoder è tenuto a inviare dati all'host.

source: The decoder may be performing a time-intensive function which precludes talking to the host, resulting in the failure of the HOST CTS to go active.
it_it: Il decoder potrebbe eseguire una funzione che richiede molto tempo e impedisce la comunicazione con l'host, con conseguente mancata attivazione dell'HOST CTS.

source: The decoder monitors the RXD line and receives the characters comprising the message.
it_it: Il decoder monitora la linea RXD e riceve i caratteri che compongono il messaggio.

source: The decoder replies by changing the state of the HOST CTS line from inactive to active, within the time frame set by the response timeout parameter.
it_it: Il decoder risponde modificando lo stato della linea HOST CTS da inattiva ad attiva, entro l'intervallo di tempo impostato dal parametro di timeout della risposta.

source: The decoder responds by changing the state of the HOST CTS line from active to inactive.
it_it: Il decoder risponde modificando lo stato della linea HOST CTS da attiva a inattiva.

source: The decoder sends a DECODE_DATA message after a successful decode.
it_it: Il decoder invia un messaggio DECODE_DATA dopo una decodifica riuscita.

source: The decoder sends a RAW DATA message after a successful decode.
it_it: Il decoder invia un messaggio RAW DATA dopo una decodifica riuscita.

source: The decoder sends data packets continuously, with no ACK/NAK handshaking to pace the transmission.
it_it: Il decoder invia pacchetti di dati in modo continuo, senza handshaking ACK/NAK per calibrare la trasmissione.

source: The decoder sends each packet in order.
it_it: Il decodificatore invia ogni pacchetto in ordine.

source: The decoder sends the decode data.
it_it: Il decoder invia i dati di decodifica.

source: The decoder waits a programmed period after sending each packet.
it_it: Il decoder attende un periodo di tempo programmato dopo l'invio di ciascun pacchetto.

source: The decoder waits for a programmable time-out for a CMD_ACK response.
it_it: Il decoder attende un timeout programmabile per una risposta CMD_ACK.

source: The decreasing of current is triggered if SG > (SEMIN + SEMAX + 1) * 32.
it_it: La riduzione di corrente si attiva se SG > (SEMIN + SEMAX + 1) * 32.

source: The decreasing of current is triggered when the load is below a limit.
it_it: La riduzione di corrente si attiva quando il carico è al di sotto di un limite.

source: The default parameters are:
it_it: I parametri di default sono:

source: The default value for this parameter must be 1, Enable.
it_it: Il valore di default per questo parametro deve essere 1, Abilita.

source: The device has an integrated 6-point ramp controller, a micro stepping indexer, the sensorless STOCK.2 technology, and the completely noiseless current control mode step chop.
it_it: Il dispositivo è dotato di un controller di rampa a 6 punti integrato, un indicizzatore micro stepping, la tecnologia sensorless StallGuard2 e la modalità di controllo della corrente completamente silenziosa Step Chop.

source: The difference between both energies gives an indication of the mechanical load taken from the motor.
it_it: La differenza tra le due energie fornisce un'indicazione del carico meccanico assorbito dal motore.

source: The double of this value is compared to SG_RESULT.
it_it: Il doppio di questo valore viene confrontato con SG_RESULT.

source: The driver provides a lower and an upper velocity threshold to match this.
it_it: Il driver fornisce una soglia di velocità inferiore e una superiore per adattarle.
